nb = int(input("please enter a number :_"))

if nb<0:
    print("------------------------------")
    print("Your Number is smallest than 0,please choose number between 1 and 999")
    print("------------------------------")

if nb>0 and nb < 10:
    if nb == 0:
        print("------------------------------")
        print("zero")
        print("------------------------------")
    if nb == 1:
        print("------------------------------")
        print("one")
        print("------------------------------")
    if nb == 2:
        print("------------------------------")
        print("two")
        print("------------------------------")
    if nb == 3:
        print("------------------------------")
        print("three")
        print("------------------------------")
    if nb == 4:
        print("------------------------------")
        print("four")
        print("------------------------------")
    if nb == 5:
        print("------------------------------")
        print("five")
        print("------------------------------")
    if nb == 6:
        print("------------------------------")
        print("six")
        print("------------------------------")
    if nb == 7:
        print("------------------------------")
        print("seven")
        print("------------------------------")
    if nb == 8:
        print("------------------------------")
        print("height")
        print("------------------------------")
    if nb == 9:
        print("------------------------------")
        print("nine")
        print("------------------------------")
if nb >9 and nb < 100:
     total2 = ((nb/10)+(nb%10))
     print("------------------------------")
     print(nb,"contain 2 digits,",int(nb/10), "and ",nb%10,", there sum = ",int(total2))
     print("------------------------------")
if nb > 99 and nb < 1000:
      ##############################################################################################################
      #int(total3)= int(nb%10) * int((nb%100)/10) * int(nb/100) האם את יכולה בבקשה להגיד לי למה זה לא עובד בבקשה ??????
     ###############################################################################################################
     num1=int(nb/100)
     num2=int((nb%100)/10)
     num3=int(nb%10)
     total3= num1*num2*num3
     print("------------------------------")
     print(nb,"contain 3 digits,",num1, ", ",num2,", ",num3,", there multiplication = ",total3)
     print("------------------------------")
if nb>999:
     print("------------------------------")
     print("Your Number containing more than 3 units,please choose number between 1 and 999")
     print("------------------------------")